In [1]:
try:
    b = open('data.csv','x')
    b.close()
except:
    print("File already exists")

In [6]:
import pandas as pd
df = pd.read_csv('data.csv') 
df

   SN   Name  Age    Address         Phone
0   1  Arjun   18      Gulmi     908876786
1   2  Shyam   20  Kathmandu       9798798
2   3   Sita   23    Sunsari  909779798798
3   4  Rohan   24    Chitwan    8980980090
4   5   Rita   21     Dharan    9878908890

In [5]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='SN') 
df

     Name  Age    Address         Phone
SN
1   Arjun   18      Gulmi     908876786
2   Shyam   20  Kathmandu       9798798
3    Sita   23    Sunsari  909779798798
4   Rohan   24    Chitwan    8980980090
5    Rita   21     Dharan    9878908890

In [8]:
print (df)

   SN   Name  Age    Address         Phone
0   1  Arjun   18      Gulmi     908876786
1   2  Shyam   20  Kathmandu       9798798
2   3   Sita   23    Sunsari  909779798798
3   4  Rohan   24    Chitwan    8980980090
4   5   Rita   21     Dharan    9878908890

In [9]:
import pandas as pd
df = pd.read_csv('data.csv',index_col='SN') 
print(df)

     Name  Age    Address         Phone
SN
1   Arjun   18      Gulmi     908876786
2   Shyam   20  Kathmandu       9798798
3    Sita   23    Sunsari  909779798798
4   Rohan   24    Chitwan    8980980090
5    Rita   21     Dharan    9878908890

In [10]:
df = pd.read_csv('data.csv',index_col='SN')
df.head()  #prints 5  data from the top

     Name  Age    Address         Phone
SN
1   Arjun   18      Gulmi     908876786
2   Shyam   20  Kathmandu       9798798
3    Sita   23    Sunsari  909779798798
4   Rohan   24    Chitwan    8980980090
5    Rita   21     Dharan    9878908890

In [11]:
df = pd.read_csv('data.csv',index_col='SN')
df.head(2)

     Name  Age    Address      Phone
SN
1   Arjun   18      Gulmi  908876786
2   Shyam   20  Kathmandu    9798798

In [12]:
df = pd.read_csv('data.csv',index_col='SN')
df.tail() #prints 5 data from the last

     Name  Age    Address         Phone
SN
2   Shyam   20  Kathmandu       9798798
3    Sita   23    Sunsari  909779798798
4   Rohan   24    Chitwan    8980980090
5    Rita   21     Dharan    9878908890
6   Sabin   21    Kailali      90989897

In [16]:
#printing required  lines of data
df = pd.read_csv('data.csv',index_col='SN')
df.iloc[2:4]

     Name  Age  Address         Phone
SN
3    Sita   23  Sunsari  909779798798
4   Rohan   24  Chitwan    8980980090

In [15]:
df = pd.read_csv('data.csv',index_col='SN')
df.loc[2:4] #prints the data according to serial number

     Name  Age    Address         Phone
SN
2   Shyam   20  Kathmandu       9798798
3    Sita   23    Sunsari  909779798798
4   Rohan   24    Chitwan    8980980090

In [18]:
df = pd.read_csv('data.csv',index_col='Name')
df.loc['Shyam':'']

       SN  Age    Address         Phone
Name
Shyam   2   20  Kathmandu       9798798
Sita    3   23    Sunsari  909779798798
Rohan   4   24    Chitwan    8980980090
Rita    5   21     Dharan    9878908890

In [22]:
df = pd.read_csv('data.csv',index_col='SN') 
df['Address']

SN
1        Gulmi
2    Kathmandu
3      Sunsari
4      Chitwan
5       Dharan
6      Kailali
Name: Address, dtype: object

In [23]:
df = pd.read_csv('data.csv',index_col='SN') 
df['Address'] == 'Kathmandu'

SN
1    False
2     True
3    False
4    False
5    False
6    False
Name: Address, dtype: bool

In [27]:
df = pd.read_csv('data.csv',index_col='SN') 
df[df['Address'] == 'Kathmandu']

     Name  Age    Address    Phone
SN
2   Shyam   20  Kathmandu  9798798

In [28]:
df = pd.read_csv('data.csv',index_col='SN') 
df[df['Age'] > 23]

     Name  Age  Address       Phone
SN
4   Rohan   24  Chitwan  8980980090

In [31]:
a = input("Enter the address you want:")
df = pd.read_csv('data.csv',index_col='SN') 
df[df['Address'] == a]

Enter the address you want:Dharan

    Name  Age Address       Phone
SN
5   Rita   21  Dharan  9878908890

In [35]:
a = input("Enter the address you want:")
df = pd.read_csv('data.csv',index_col='SN') 
df[(df['Address'] == a) & (df['Age'] == 21)]

Enter the address you want:Dharan

     Name  Age Address       Phone
SN
5    Rita   21  Dharan  9878908890
6   Sabin   21  Dharan    90989897

In [32]:
df = pd.read_csv('data.csv',index_col='SN') 
new_data = df[df['Age'] > 21] 
new_data.to_csv('naya_data.csv')

In [36]:
# df = pd.DataFrame(data) # adding dictionary (data) in DataFrame
# df.to_csv('record.csv')
# df

In [37]:
#adding list in csv file
#adding list inside list in csv file

In [39]:
# import csv
# fields = ['Kamal','56','Sunsari']
# f = open('data.csv','a')
# x = csv.writer(f)
# x.writerow(fields)
# f.close()